[
    {
        "id": "01",
        "category_id": "01",
        "title": "Angular JS",
        "image_url": "https://miro.medium.com/max/1400/1*Jb9xAs1zglLMElx-cpNRAg.png",
        "details": "Angular, previously known as Angular JS, is a single web development framework developed by Google for both desktop and mobile web applications.Angular aims at creating progressive web apps by offering dependency injection that helps in data service assembly for applications while an HTML template is used for composing templates."
    },
    {
        "id": "02",
        "category_id": "03",
        "title": "React JS",
        "image_url": "https://matob.web.id/random/wp-content/uploads/sites/2/2021/12/react-JS-NEW.jpg",
        "details": "React is Facebook's component-based web development and library for making UIs and offering declarative views, which makes the code more predictable and more comfortable to debug.It does not support controllers or models. React can also render on the server using Node and power mobile apps using React Native. In short, it allows you to build powerful, fast, user-friendly, and reactive web apps."
    },
    {
        "id": "03",
        "category_id": "01",
        "title": "Vue JS",
        "image_url": "https://wallpaperaccess.com/full/4584347.png",
        "details": "Vue.js is another open-source progressive JavaScript framework for building user interfaces, similar to React.The USP of Vue.js is its adaptability, integration into projects that use other JavaScript libraries is very easy with Vue because it is designed to be incrementally adoptable."
    },
    {
        "id": "04",
        "category_id": "02",
        "title": "Ember JS",
        "image_url": "https://www.rlogical.com/wp-content/uploads/2021/01/Ember.js-1200x675.png",
        "details": "Ember.js is another popular, open-source JavaScript web framework that is based on the Model and View pattern.It allows developers to create scalable single-page web applications by incorporating common idioms and best practices into the framework itself.It has integrated features like templates, also known as handlebars, that helps in writing less code and have the ability to update themselves with a change in data. Ember.js can be installed via NPM."
    },
    {
        "id": "05",
        "category_id": "03",
        "title": "Meteor JS",
        "image_url": "https://vexxhost.com/wp-content/uploads/2014/07/Small-Dive-Into-Meteor.JS.png",
        "details": "Meteor or MeteorJS is a full-stack JavaScript platform for developing modern web and mobile applications.Meteor includes an essential set of technologies for building connected-client reactive applications, a build tool, and a curated set of packages from the Node.js and general JavaScript community."
    },
    {
        "id": "06",
        "category_id": "01",
        "title": "Node JS",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Node.js_logo.svg/1200px-Node.js_logo.svg.png",
        "details": "Node.js or Node JS is another robust JavaScript framework that allows you to develop a server-side component using JavaScript. The most significant advantage of Node JS is that now you can develop a web application end-to-end using just JavaScript. It's also free and runs on various platforms (Windows, Linux, Unix, Mac OS X, etc.) Node.js uses an asynchronous, event-driven, non-blocking I/O model that makes it lightweight and efficient."
    },
    {
        "id": "07",
        "category_id": "02",
        "title": "Polymer JS",
        "image_url": "https://jelvix.com/wp-content/uploads/2018/09/polymer.js_.jpg",
        "details": "The polymer is another open-source JavaScript library that helps you create custom reusable HTML elements, which can be used to build performant, maintainable web applications.If you compare Angular with Polymer as both are developed by Google, then Angular is a complete framework for building web apps, whereas Polymer is just a library for creating Web Components."
    },
    {
        "id": "08",
        "category_id": "04",
        "title": " jQuery JS",
        "image_url": "https://miro.medium.com/max/1024/1*tsqlgfBBb32ZLx1Y6bwzKA.jpeg",
        "details": "jQuery is probably the most popular JavaScript library out there, which provides so many features for modern-day development.You can use jQuery API for event handling, animation, and manipulating the HTML document, also known as DOM. Besides this, jQuery is being used with Angular and React App building tools too. In short, one of the must-know JavaScript library for web development."
    }
]